In [1]:
import numpy as np
import pandas as pd

In [2]:
from numpy.random import randn

In [3]:
np.random.seed(101)

In [4]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['Q','W','E','R'])

In [5]:
df

          Q         W         E         R
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [9]:
df['W']

A    0.628133
B   -0.319318
C    0.740122
D   -0.758872
E    1.978757
Name: W, dtype: float64

In [7]:
type(df['W'])

pandas.core.series.Series

In [10]:
df.W

A    0.628133
B   -0.319318
C    0.740122
D   -0.758872
E    1.978757
Name: W, dtype: float64

In [11]:
df[['Q','W']]

          Q         W
A  2.706850  0.628133
B  0.651118 -0.319318
C -2.018168  0.740122
D  0.188695 -0.758872
E  0.190794  1.978757

In [12]:
df['new'] = df['W'] + df['Q']

In [17]:
df

          Q         W         E         R
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [16]:
df.drop('new',axis=1,inplace=True)

In [6]:
df.loc['A']

Q    2.706850
W    0.628133
E    0.907969
R    0.503826
Name: A, dtype: float64

In [8]:
df.iloc[0]

Q    2.706850
W    0.628133
E    0.907969
R    0.503826
Name: A, dtype: float64

In [9]:
df.loc['A','Q']

2.706849839399938

In [12]:
df.loc[['A','B'],['Q','W']]

          Q         W
A  2.706850  0.628133
B  0.651118 -0.319318

# Conditional

In [14]:
booldf = df>0

In [15]:
booldf

       Q      W      E      R
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [17]:
df[booldf]

          Q         W         E         R
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

## Another

In [18]:
df['W']>0

A     True
B    False
C     True
D    False
E     True
Name: W, dtype: bool

In [19]:
df[df['W']>0]

          Q         W         E         R
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

In [20]:
df[df['W']>0]['W']

A    0.628133
C    0.740122
E    1.978757
Name: W, dtype: float64

In [21]:
df[df['W']>0][['W','E']]

          W         E
A  0.628133  0.907969
C  0.740122  0.528813
E  1.978757  2.605967